app/channels/application_cable/connection.rb

      def find_verified_user
        if verified_user = User.find_by(id: cookies.signed[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]