app/views/messages/_message.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                </div>
                <%= image_tag(message.user.avatar.present? ? message.user.avatar.url : "sample.jpg", class: "w-12 h-12  order-1 rounded-full shadow-lg") %>