lib/tasks/fetch_parks.rake

SELECT "parks".* FROM "parks" WHERE "parks"."place_id" = $1 LIMIT $2  [["place_id", "ChIJzxU4dQaMGGARqVFTClYRMLQ"], ["LIMIT", 1]]
---
    def get_detail_data(park)
      place_id = get_place_id(park['住所'])

      if place_id
        existing_park = Park.find_by(place_id: place_id) # データベース内を検索

INSERT INTO "parks" ("name", "postal_code", "address", "opening_hours", "web_site", "latitude", "longitude", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    CSV.foreach(csv_file, headers: true) do |row|
      park_data = get_detail_data(row)
      if park_data
        park= Park.create!(park_data)