app/views/events/show.html.erb

            <p>参加予定人数</p>
            <p><%= @event.user_events.count %></p>
---
SELECT COUNT(*) FROM "user_events" WHERE "user_events"."event_id" = $1  [["event_id", 2]]