app/channels/room_channel.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at", "room_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "あたば"], ["user_id", 2], ["created_at", "2023-12-22 04:59:16.551933"], ["updated_at", "2023-12-22 04:59:16.551933"], ["room_id", 1]]
---
  def speak(data)
    event = Event.find_by(id: data['event_id'])
    if event
      Message.create! content: data['message'], user_id: current_user.id, room_id: event.room.id