app/controllers/events_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 4], ["id", 1]]
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
    def index
        @events = Event.where('datetime > ?', DateTime.now).includes(:user).order(created_at: :desc).page(params[:page])
        @participating_events = current_user.participating_events.page(params[:page])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 2]]
---
    def show
        @event = Event.find(params[:id])
        @messages = Message.where(room_id: @event.room.id)

INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["event_id", 2], ["created_at", "2023-12-16 06:14:25.903398"], ["updated_at", "2023-12-16 06:14:25.903398"]]
INSERT INTO "rooms" ("message_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message_id", nil], ["event_id", 1], ["created_at", "2023-12-21 12:39:04.541794"], ["updated_at", "2023-12-21 12:39:04.541794"]]
---
    def create
        @event = current_user.events.new(event_params)
        if @event.save
            UserEvent.create(user: current_user, event: @event)
            Room.create!(event: @event)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["latitude", "35.6966739"], ["longitude", "139.7342962"], ["updated_at", "2023-12-15 04:58:00.137950"], ["id", 3]]
---
    def update
        @event = current_user.events.find(params[:id])
        if @event.update(event_params)

SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1  [["event_id", 3]]
DELETE FROM "user_events" WHERE "user_events"."id" = $1  [["id", 1]]
---
    def destroy
        @event = Event.find(params[:id])
        @event.destroy