app/controllers/event_attendances_controller.rb

    def create
        @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def destroy
        @event = current_user.event_attendances.find(params[:id]).event
---
SELECT "event_attendances".* FROM "event_attendances" WHERE "event_attendances"."user_id" = $1 AND "event_attendances"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 39], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]