app/controllers/match_results_controller.rb

    def new
        @match_result = MatchResult.new
        @event = Event.find(params[:event_id])
        @users = @event.users.where.not(id: current_user.id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @event = Event.find(params[:event_id])
        match_result_params[:results].each do |user_id, result|
            @match_result = MatchResult.new
            @match_result.event = @event
            @match_result.user_1 = current_user
            @match_result.user_2_id = user_id
            @match_result.winner_id = result == 'WIN' ? current_user.id : user_id
            if @match_result.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "match_results" ("event_id", "user_1_id", "user_2_id", "winner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 2], ["user_1_id", 2], ["user_2_id", 1], ["winner_id", 2], ["created_at", "2023-12-16 06:58:53.190525"], ["updated_at", "2023-12-16 06:58:53.190525"]]