app/controllers/profiles_controller.rb

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "play_video" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["play_video", "Miley_Cyrus_-_Party_In_The_U.S.A.__Official_Video_.mp4"], ["updated_at", "2023-12-15 07:06:22.172259"], ["id", 1]]

    def set_user
        @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]