app/controllers/static_pages_controller.rb

SELECT "parks".* FROM "parks"
---
    def top
        @parks = Park.all