app/controllers/user_events_controller.rb

    def create
        @event = Event.find(params[:event_id])
        @user_event = UserEvent.create(user: current_user, event: @event)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["event_id", 3], ["created_at", "2023-12-15 03:56:48.530193"], ["updated_at", "2023-12-15 03:56:48.530193"]]

    def destroy
        @event = Event.find(params[:event_id])
        @user_event = UserEvent.find_by(user: current_user, event: @event)
        @user_event.destroy
---
SELECT "user_events".* FROM "user_events" WHERE "user_events"."user_id" = $1 AND "user_events"."event_id" = $2 LIMIT $3  [["user_id", 4], ["event_id", 3], ["LIMIT", 1]]
DELETE FROM "user_events" WHERE "user_events"."id" = $1  [["id", 3]]