app/models/match_result.rb

SELECT 1 AS one FROM "match_results" WHERE "match_results"."event_id" = $1 AND "match_results"."user_1_id" IN ($2, $3) AND ("match_results"."user_2_id" IN ($4, $5) OR "match_results"."user_2_id" IN ($6, $7)) LIMIT $8  [["event_id", 3], ["user_1_id", 3], ["user_1_id", 1], ["user_2_id", 3], ["user_2_id", 1], ["user_2_id", 1], ["user_2_id", 3], ["LIMIT", 1]]
---
  def self.result_exists?(user1, user2, event)
    where(event_id: event.id, user_1_id: [user1.id, user2.id], user_2_id: [user1.id, user2.id]).or(
      where(event_id: event.id, user_1_id: [user1.id, user2.id], user_2_id: [user2.id, user1.id])
    ).exists?

SELECT "users".* FROM "users"
---
  def self.match_count
    User.all.map do |user|

SELECT "users".* FROM "users"
---
  def self.win_count
    User.all.map do |user|

SELECT "users".* FROM "users"
---
  def self.win_rate
    match_counts = self.match_count
    win_counts = self.win_count

    User.all.map do |user|