app/models/user.rb

  def participating_in?(event)
    self.user_events.exists?(event_id: event.id)
---
SELECT 1 AS one FROM "user_events" WHERE "user_events"."user_id" = $1 AND "user_events"."event_id" = $2 LIMIT $3  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]

  def bookmark(event)
    event_attendances_events << event
---
INSERT INTO "event_attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["event_id", 3], ["created_at", "2023-12-19 06:15:05.917807"], ["updated_at", "2023-12-19 06:15:05.917807"]]

  def unbookmark(event)
    event_attendances_events.destroy(event)
---
DELETE FROM "event_attendances" WHERE "event_attendances"."id" = $1  [["id", 1]]