app/views/event_attendances/_btn.html.erb

SELECT "event_attendances".* FROM "event_attendances" WHERE "event_attendances"."user_id" = $1 AND "event_attendances"."event_id" = $2 LIMIT $3  [["user_id", 2], ["event_id", 3], ["LIMIT", 1]]
---
<% if current_user.bookmark?(event) %>
    <%= link_to event_attendance_path(current_user.event_attendances.find_by(event_id: event.id)), data: { turbo_method: :delete }, remote: true, id: "js-bookmark-button-for-event-#{event.id}" do%>